let currentLayer = null;




/* =========================================================
   MAP TILES
========================================================= */

const DARK_MAP =
'https://{s}.basemaps.cartocdn.com/dark_all/{z}/{x}/{y}{r}.png';


const LIGHT_MAP =
'https://tile.openstreetmap.org/{z}/{x}/{y}.png';




/* =========================================================
   ГРАНИЦЫ ОДНОГО МИРА
========================================================= */

const WORLD_BOUNDS = [

    [
        -85.05112878,
        -180
    ],

    [
        85.05112878,
        180
    ]

];




/* =========================================================
   THEME
========================================================= */

export function getMapTheme(){


    return localStorage.getItem(
        'map-theme'
    ) || 'dark';


}




/* =========================================================
   SET THEME
========================================================= */

export function setMapTheme(theme){


    localStorage.setItem(
        'map-theme',
        theme
    );


}




/* =========================================================
   TILE URL
========================================================= */

export function getTileUrl(){


    const theme =
        getMapTheme();


    if(theme === 'light'){

        return LIGHT_MAP;

    }


    return DARK_MAP;


}




/* =========================================================
   CURRENT TILE LAYER
========================================================= */

export function setCurrentTileLayer(layer){


    currentLayer =
        layer;


}




/* =========================================================
   RELOAD MAP THEME
========================================================= */

export function reloadMapTheme(map, L){


    /* =====================================================
       УДАЛЯЕМ СТАРЫЙ СЛОЙ
    ===================================================== */

    if(currentLayer){

        map.removeLayer(
            currentLayer
        );

    }




    /* =====================================================
       СОЗДАЁМ НОВЫЙ СЛОЙ
    ===================================================== */

    currentLayer =
        L.tileLayer(

            getTileUrl(),

            {

                maxZoom:19,

                minZoom:2,

                noWrap:true,

                bounds:WORLD_BOUNDS

            }

        );




    /* =====================================================
       ДОБАВЛЯЕМ
    ===================================================== */

    currentLayer.addTo(
        map
    );




    /* =====================================================
       СОХРАНЯЕМ
    ===================================================== */

    setCurrentTileLayer(
        currentLayer
    );


}